In [2]:
import pandas as pd
import numpy as np

In [12]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns = cols)
df

   omset  operasional
0     16           19
1     17            2
2      2           11
3     18           17
4     15           17

In [13]:
df['omset'] = df['omset']*100_000
df['operasional']=df['operasional']*10_000
df

     omset  operasional
0  1600000       190000
1  1700000        20000
2   200000       110000
3  1800000       170000
4  1500000       170000

In [14]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

D:\WPy64-3770\python-3.7.7.amd64\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     tanggal    omset  operasional
0 2000-01-01  1600000       190000
1 2000-01-02  1700000        20000
2 2000-01-03   200000       110000
3 2000-01-04  1800000       170000
4 2000-01-05  1500000       170000

In [16]:
formatku = {'tanggal':'{:%d/%m/%y}',
            'omset':'Rp {:.2f}',
            'operasional':'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan

In [17]:
type(laporan)

pandas.io.formats.style.Styler

In [18]:
laporan.hide_index()

In [19]:
laporan.set_caption('Data omset operasional')

In [20]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')